"""
Python model 'dornodjinkencopy2.py'
Translated using PySD
"""

from pathlib import Path
import numpy as np
import xarray as xr

from pysd.py_backend.functions import sum, integer, if_then_else
from pysd.py_backend.statefuls import Integ
from pysd.py_backend.lookups import HardcodedLookups
from pysd import Component

__pysd_version__ = "3.14.3"

__data = {"scope": None, "time": lambda: 0}

_root = Path(__file__).parent


_subscript_dict = {
    "Бэлчээрийн малын төрөл": ["Адуу", "Үхэр", "Тэмээ", "Хонь", "Ямаа"],
    "Дорнод аймгийн сумууд": [
        "Хэрлэн",
        "Баяндун",
        "Баянтүмэн",
        "Баян Уул",
        "Булган",
        "Гурванзагал",
        "Дашбалбар",
        "Матад",
        "Сэргэлэн",
        "Халхгол",
        "Хөлөнбуйр",
        "Цагаан Овоо",
        "Чойбалсан",
        "Чулуунхороот",
    ],
}

component = Component()

#######################################################################
#                          CONTROL VARIABLES                          #
#######################################################################

_control_vars = {
    "initial_time": lambda: 2014,
    "final_time": lambda: 2040,
    "time_step": lambda: 1,
    "saveper": lambda: time_step(),
}


def _init_outer_references(data):
    for key in data:
        __data[key] = data[key]


@component.add(name="Time")
def time():
    """
    Current time of the model.
    """
    return __data["time"]()


@component.add(
    name="FINAL TIME", units="Month", comp_type="Constant", comp_subtype="Normal"
)
def final_time():
    """
    The final time for the simulation.
    """
    return __data["time"].final_time()


@component.add(
    name="INITIAL TIME", units="Month", comp_type="Constant", comp_subtype="Normal"
)
def initial_time():
    """
    The initial time for the simulation.
    """
    return __data["time"].initial_time()


@component.add(
    name="SAVEPER",
    units="Month",
    limits=(0.0, np.nan),
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"time_step": 1},
)
def saveper():
    """
    The frequency with which output is stored.
    """
    return __data["time"].saveper()


@component.add(
    name="TIME STEP",
    units="Month",
    limits=(0.0, np.nan),
    comp_type="Constant",
    comp_subtype="Normal",
)
def time_step():
    """
    The time step for the simulation.
    """
    return __data["time"].time_step()


#######################################################################
#                           MODEL VARIABLES                           #
#######################################################################


@component.add(
    name="Байгалийн гамшгийн бэлчээрийн мал сүргийн нөхөн төлжих нөлөө",
    comp_type="Constant",
    comp_subtype="Normal",
)
def nvs_():
    return 1.2


@component.add(
    name="Байгалийн гамшгийн давтамж", comp_type="Constant", comp_subtype="Normal"
)
def nvs__1():
    return 7


@component.add(
    name="Байгалийн гамшиг бэлчээрийн мал сүргийн хорогдолд бүсээс шалтгаалан нөлөөлөх нөлө",
    subscripts=["Бэлчээрийн малын төрөл"],
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__32": 1},
)
def nvs__2():
    return nvs__32()


@component.add(
    name="Байгалийн гамшиг бэлчээрийн мал сүргийн хорогдолд нөлөөлөх нөлөө",
    subscripts=["Бэлчээрийн малын төрөл"],
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__2": 5, "nvs__17": 5},
)
def nvs__3():
    value = xr.DataArray(
        np.nan,
        {"Бэлчээрийн малын төрөл": _subscript_dict["Бэлчээрийн малын төрөл"]},
        ["Бэлчээрийн малын төрөл"],
    )
    value.loc[["Адуу"]] = float(nvs__2().loc["Адуу"]) * nvs__17()
    value.loc[["Үхэр"]] = float(nvs__2().loc["Үхэр"]) * nvs__17()
    value.loc[["Тэмээ"]] = float(nvs__2().loc["Тэмээ"]) * nvs__17()
    value.loc[["Хонь"]] = float(nvs__2().loc["Хонь"]) * nvs__17()
    value.loc[["Ямаа"]] = float(nvs__2().loc["Ямаа"]) * nvs__17()
    return value


@component.add(
    name="Байгалийн гамшиг тохиолдсон анхны жил",
    comp_type="Constant",
    comp_subtype="Normal",
)
def nvs__4():
    return 2100


@component.add(
    name="Байгалийн гамшиг тохиолдсон он",
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__4": 1, "nvs__1": 1, "nvs__30": 1, "nvs__18": 1},
)
def nvs__5():
    return nvs__4() + nvs__1() * nvs__18() * nvs__30()


@component.add(
    name="Борлуулсан болон хүнсэнд хэрэглэсэн малын хувь хэмжээ",
    subscripts=["Бэлчээрийн малын төрөл"],
    comp_type="Constant",
    comp_subtype="Normal",
)
def nvs__6():
    return xr.DataArray(
        [0.3, 0.29, 0.1, 0.43, 0.39],
        {"Бэлчээрийн малын төрөл": _subscript_dict["Бэлчээрийн малын төрөл"]},
        ["Бэлчээрийн малын төрөл"],
    )


@component.add(
    name="Борлуулсан болон хүнсэнд хэрэглэсэн малын тоо толгой",
    subscripts=["Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"],
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"time": 10, "nvs__14": 10, "nvs__34": 5, "nvs__6": 5},
)
def nvs__7():
    value = xr.DataArray(
        np.nan,
        {
            "Дорнод аймгийн сумууд": _subscript_dict["Дорнод аймгийн сумууд"],
            "Бэлчээрийн малын төрөл": _subscript_dict["Бэлчээрийн малын төрөл"],
        },
        ["Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"],
    )
    value.loc[:, ["Адуу"]] = (
        integer(
            if_then_else(
                time() <= 2024,
                lambda: nvs__14().loc[:, "Адуу"].reset_coords(drop=True)
                * nvs__34(time()).loc[:, "Адуу"].reset_coords(drop=True),
                lambda: nvs__14().loc[:, "Адуу"].reset_coords(drop=True)
                * float(nvs__6().loc["Адуу"]),
            )
        )
        .expand_dims({"Бэлчээрийн малын төрөл": ["Адуу"]}, 1)
        .values
    )
    value.loc[:, ["Үхэр"]] = (
        if_then_else(
            time() <= 2024,
            lambda: nvs__14().loc[:, "Үхэр"].reset_coords(drop=True)
            * nvs__34(time()).loc[:, "Үхэр"].reset_coords(drop=True),
            lambda: nvs__14().loc[:, "Үхэр"].reset_coords(drop=True)
            * float(nvs__6().loc["Үхэр"]),
        )
        .expand_dims({"Бэлчээрийн малын төрөл": ["Үхэр"]}, 1)
        .values
    )
    value.loc[:, ["Тэмээ"]] = (
        if_then_else(
            time() <= 2024,
            lambda: nvs__14().loc[:, "Тэмээ"].reset_coords(drop=True)
            * nvs__34(time()).loc[:, "Тэмээ"].reset_coords(drop=True),
            lambda: nvs__14().loc[:, "Тэмээ"].reset_coords(drop=True)
            * float(nvs__6().loc["Тэмээ"]),
        )
        .expand_dims({"Бэлчээрийн малын төрөл": ["Тэмээ"]}, 1)
        .values
    )
    value.loc[:, ["Хонь"]] = (
        if_then_else(
            time() <= 2024,
            lambda: nvs__14().loc[:, "Хонь"].reset_coords(drop=True)
            * nvs__34(time()).loc[:, "Хонь"].reset_coords(drop=True),
            lambda: nvs__14().loc[:, "Хонь"].reset_coords(drop=True)
            * float(nvs__6().loc["Хонь"]),
        )
        .expand_dims({"Бэлчээрийн малын төрөл": ["Хонь"]}, 1)
        .values
    )
    value.loc[:, ["Ямаа"]] = (
        if_then_else(
            time() <= 2024,
            lambda: nvs__14().loc[:, "Ямаа"].reset_coords(drop=True)
            * nvs__34(time()).loc[:, "Ямаа"].reset_coords(drop=True),
            lambda: nvs__14().loc[:, "Ямаа"].reset_coords(drop=True)
            * float(nvs__6().loc["Ямаа"]),
        )
        .expand_dims({"Бэлчээрийн малын төрөл": ["Ямаа"]}, 1)
        .values
    )
    return value


@component.add(
    name="Бэлчээрийн мал мүргийн гашигаар хорогдох хорогдолын нөлөө",
    subscripts=["Бэлчээрийн малын төрөл"],
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"time": 2, "nvs__5": 2, "nvs__3": 1},
)
def nvs__8():
    return if_then_else(
        np.logical_or(time() < nvs__5(), time() > nvs__5() + 1),
        lambda: xr.DataArray(
            0,
            {"Бэлчээрийн малын төрөл": _subscript_dict["Бэлчээрийн малын төрөл"]},
            ["Бэлчээрийн малын төрөл"],
        ),
        lambda: nvs__3(),
    )


@component.add(
    name="Бэлчээрийн мал сүргийн төллөлт",
    subscripts=["Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"],
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__13": 1, "nvs__19": 1, "nvs__14": 1},
)
def nvs__9():
    return nvs__13() * nvs__19() * nvs__14()


@component.add(
    name="Бэлчээрийн малын анхны тоо толгой",
    subscripts=["Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"],
    comp_type="Constant",
    comp_subtype="Normal",
)
def nvs__10():
    return xr.DataArray(
        [
            [1.600e04, 1.560e04, 3.000e02, 5.410e04, 3.380e04],
            [8.400e03, 1.210e04, 2.000e02, 7.260e04, 3.450e04],
            [1.540e04, 9.800e03, 7.000e02, 4.230e04, 2.670e04],
            [9.200e03, 1.310e04, 1.000e02, 3.460e04, 2.450e04],
            [1.310e04, 8.000e03, 3.000e02, 3.870e04, 2.620e04],
            [1.090e04, 7.000e03, 2.000e02, 4.080e04, 2.730e04],
            [1.740e04, 1.330e04, 6.000e02, 1.024e05, 4.820e04],
            [1.690e04, 1.370e04, 4.000e02, 3.820e04, 2.480e04],
            [1.480e04, 8.400e03, 5.000e02, 6.490e04, 3.240e04],
            [9.300e03, 8.400e03, 3.000e02, 1.340e04, 9.000e03],
            [1.190e04, 7.200e03, 4.000e02, 4.450e04, 2.260e04],
            [1.510e04, 1.220e04, 3.000e02, 6.400e04, 4.360e04],
            [1.150e04, 8.100e03, 3.000e02, 3.870e04, 2.630e04],
            [6.800e03, 5.600e03, 1.000e02, 2.430e04, 1.670e04],
        ],
        {
            "Дорнод аймгийн сумууд": _subscript_dict["Дорнод аймгийн сумууд"],
            "Бэлчээрийн малын төрөл": _subscript_dict["Бэлчээрийн малын төрөл"],
        },
        ["Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"],
    )


@component.add(
    name="Нийт нядлагдаагүй хорогдсон мал сүргийн тоо сумдаар",
    subscripts=["Дорнод аймгийн сумууд"],
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__22": 1},
)
def nvs__11():
    return sum(
        nvs__22().rename({"Бэлчээрийн малын төрөл": "Бэлчээрийн малын төрөл!"}),
        dim=["Бэлчээрийн малын төрөл!"],
    )


@component.add(
    name="Бэлчээрийн малын нөхөн үржих хувь хэмжээ",
    subscripts=["Бэлчээрийн малын төрөл"],
    comp_type="Constant",
    comp_subtype="Normal",
)
def nvs__12():
    return xr.DataArray(
        [0.32, 0.37, 0.1, 0.42, 0.4],
        {"Бэлчээрийн малын төрөл": _subscript_dict["Бэлчээрийн малын төрөл"]},
        ["Бэлчээрийн малын төрөл"],
    )


@component.add(
    name="Бэлчээрийн малын нөхөн үржих хурд",
    subscripts=["Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"],
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"time": 2, "nvs__35": 1, "nvs__12": 1},
)
def nvs__13():
    return if_then_else(
        time() <= 2024,
        lambda: nvs__35(time()),
        lambda: nvs__12().expand_dims(
            {"Дорнод аймгийн сумууд": _subscript_dict["Дорнод аймгийн сумууд"]}, 0
        ),
    )


@component.add(
    name="Бэлчээрийн малын тоо толгой",
    subscripts=["Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"],
    comp_type="Stateful",
    comp_subtype="Integ",
    depends_on={"_integ_nvs_14": 1},
    other_deps={
        "_integ_nvs_14": {
            "initial": {"nvs__10": 1},
            "step": {"nvs__9": 1, "nvs__22": 1, "nvs__7": 1},
        }
    },
)
def nvs__14():
    """
    Бэлчээрийн мал сүргийн төрөл[Ховд сумууд,Бэлчээрийн малын төрөл]-Нядлагдаагүй хорогдсон мал сүргийн тоо толгой[Ховд сумууд,Бэлчээрийн малын төрөл]-Нядлагдсан бэлчээрийн мал сүргийн тоо толгой[Ховд сумууд,Бэлчээрийн малын төрөл]
    """
    return _integ_nvs_14()


_integ_nvs_14 = Integ(
    lambda: nvs__9() - nvs__22() - nvs__7(), lambda: nvs__10(), "_integ_nvs_14"
)


@component.add(
    name="Хоёр мянга арван оныхтой харьцуулсн Байгалийн гамшгийн хэмжээ",
    comp_type="Constant",
    comp_subtype="Normal",
)
def nvs__15():
    return 1


@component.add(
    name="Хэрэгцээнд нядалсан малын эзлэх хувь",
    subscripts=["Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"],
    comp_type="Constant",
    comp_subtype="Normal",
)
def nvs__16():
    return xr.DataArray(
        0.5,
        {
            "Дорнод аймгийн сумууд": _subscript_dict["Дорнод аймгийн сумууд"],
            "Бэлчээрийн малын төрөл": _subscript_dict["Бэлчээрийн малын төрөл"],
        },
        ["Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"],
    )


@component.add(
    name="Гамшгийн хорогдолын хэмжээ",
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"time": 2, "nvs__5": 2, "nvs__15": 1},
)
def nvs__17():
    return if_then_else(
        np.logical_and(time() >= nvs__5(), time() < nvs__5() + 1),
        lambda: nvs__15(),
        lambda: 0,
    )


@component.add(
    name="Гамшгийн үржигдэхүүн",
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"time": 2, "nvs__4": 2, "nvs__1": 1, "nvs__30": 1},
)
def nvs__18():
    return if_then_else(
        time() <= nvs__4(),
        lambda: 0,
        lambda: integer((time() - nvs__4()) / nvs__1() / nvs__30()),
    )


@component.add(
    name="Гамшгийн дараа бэлчээрийн мал сүргийн нөхөн сэргэх сэргэлтийн нөлөө",
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"time": 2, "nvs__5": 2, "nvs_": 1},
)
def nvs__19():
    return if_then_else(
        np.logical_or(time() <= nvs__5() + 0.5, time() > nvs__5() + 2),
        lambda: 1,
        lambda: nvs_(),
    )


@component.add(
    name="Нийт нядлагдаагүй хорогдсон мал сүргийн тоо",
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__11": 1},
)
def nvs__20():
    return sum(
        nvs__11().rename({"Дорнод аймгийн сумууд": "Дорнод аймгийн сумууд!"}),
        dim=["Дорнод аймгийн сумууд!"],
    )


@component.add(
    name="Зудаар хорогдох бэлчээрийн мал сүргийн хувь хэмжээ",
    subscripts=["Бэлчээрийн малын төрөл"],
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__8": 1, "nvs__30": 1},
)
def nvs__21():
    return nvs__8() / nvs__30()


@component.add(
    name="Малын зүй бус хорогдол",
    subscripts=["Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"],
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"time": 2, "nvs__14": 2, "nvs__33": 1, "nvs__21": 1},
)
def nvs__22():
    return integer(
        if_then_else(
            time() <= 2024,
            lambda: nvs__14() * nvs__33(time()),
            lambda: (
                (0.004 + nvs__21())
                * nvs__14().transpose("Бэлчээрийн малын төрөл", "Дорнод аймгийн сумууд")
            ).transpose("Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"),
        )
    )


@component.add(
    name="Нийт бэлчээрийн мал хонин толгойд шилжүүлснээр",
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__24": 1},
)
def nvs__23():
    return sum(
        nvs__24().rename({"Дорнод аймгийн сумууд": "Дорнод аймгийн сумууд!"}),
        dim=["Дорнод аймгийн сумууд!"],
    )


@component.add(
    name="Нийт бэлчээрийн мал хонин толгойд шилжүүлснээр Сум тус бүрээр",
    subscripts=["Дорнод аймгийн сумууд"],
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__14": 5},
)
def nvs__24():
    return (
        nvs__14().loc[:, "Адуу"].reset_coords(drop=True) * 7
        + nvs__14().loc[:, "Үхэр"].reset_coords(drop=True) * 6
        + nvs__14().loc[:, "Тэмээ"].reset_coords(drop=True) * 5
        + nvs__14().loc[:, "Хонь"].reset_coords(drop=True)
        + nvs__14().loc[:, "Ямаа"].reset_coords(drop=True) * 0.9
    )


@component.add(
    name="Нийт бэлчээрийн малд эзлэх хорогдсон малын хувь хэмжээ",
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__31": 1, "nvs__27": 1},
)
def nvs__25():
    return sum(
        nvs__31().rename({"Дорнод аймгийн сумууд": "Дорнод аймгийн сумууд!"}),
        dim=["Дорнод аймгийн сумууд!"],
    ) / sum(
        nvs__27().rename({"Дорнод аймгийн сумууд": "Дорнод аймгийн сумууд!"}),
        dim=["Дорнод аймгийн сумууд!"],
    )


@component.add(
    name="Нийт бэлчээрийн малын тоо",
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__14": 1},
)
def nvs__26():
    return sum(
        nvs__14().rename(
            {
                "Дорнод аймгийн сумууд": "Дорнод аймгийн сумууд!",
                "Бэлчээрийн малын төрөл": "Бэлчээрийн малын төрөл!",
            }
        ),
        dim=["Дорнод аймгийн сумууд!", "Бэлчээрийн малын төрөл!"],
    )


@component.add(
    name="Нийт бэлчээрийн малын тоо сум тус бүрээр",
    subscripts=["Дорнод аймгийн сумууд"],
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__14": 1},
)
def nvs__27():
    return sum(
        nvs__14().rename({"Бэлчээрийн малын төрөл": "Бэлчээрийн малын төрөл!"}),
        dim=["Бэлчээрийн малын төрөл!"],
    )


@component.add(
    name='"Нийт бэлчээрийн тоо толгой /төрлөөр/"',
    subscripts=["Бэлчээрийн малын төрөл"],
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__14": 1},
)
def nvs__28():
    return sum(
        nvs__14().rename({"Дорнод аймгийн сумууд": "Дорнод аймгийн сумууд!"}),
        dim=["Дорнод аймгийн сумууд!"],
    )


@component.add(
    name="Хүн амын хэрэгцээнд нядалсан мал",
    subscripts=["Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"],
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__14": 1, "nvs__16": 1},
)
def nvs__29():
    return nvs__14() * nvs__16()


@component.add(name="Нэг жил", comp_type="Constant", comp_subtype="Normal")
def nvs__30():
    return 1


@component.add(
    name="Нийт нядлагдаагүй хорогдсон малын тоо сумдаар",
    subscripts=["Дорнод аймгийн сумууд"],
    comp_type="Auxiliary",
    comp_subtype="Normal",
    depends_on={"nvs__22": 1},
)
def nvs__31():
    return sum(
        nvs__22().rename({"Бэлчээрийн малын төрөл": "Бэлчээрийн малын төрөл!"}),
        dim=["Бэлчээрийн малын төрөл!"],
    )


@component.add(
    name="Хээр талын бүсд байгалийн гамшиг нөлөөлөх нөлөө",
    subscripts=["Бэлчээрийн малын төрөл"],
    comp_type="Constant",
    comp_subtype="Normal",
)
def nvs__32():
    return xr.DataArray(
        [0.0925, 0.1125, 0.02, 0.114, 0.13125],
        {"Бэлчээрийн малын төрөл": _subscript_dict["Бэлчээрийн малын төрөл"]},
        ["Бэлчээрийн малын төрөл"],
    )


@component.add(
    name="Хорогдсон бэлчээрийн малын хувь хэмжээ",
    subscripts=["Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"],
    comp_type="Lookup",
    comp_subtype="Normal",
    depends_on={"__lookup__": "_hardcodedlookup_nvs_33"},
)
def nvs__33(x, final_subs=None):
    return _hardcodedlookup_nvs_33(x, final_subs)


_hardcodedlookup_nvs_33 = HardcodedLookups(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [0.0, 0.00529101, 0.0, 0.0, 0.0, 0.00414938, 0.0, 0.0, 0.0, 0.00740741, 0.20438],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Адуу"]},
    "interpolate",
    {
        "Дорнод аймгийн сумууд": _subscript_dict["Дорнод аймгийн сумууд"],
        "Бэлчээрийн малын төрөл": _subscript_dict["Бэлчээрийн малын төрөл"],
    },
    "_hardcodedlookup_nvs_33",
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0119048,
        0.0106383,
        0.00943396,
        0.0,
        0.0,
        0.0,
        0.00632911,
        0.0,
        0.0,
        0.00413223,
        0.0196078,
    ],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.00549451,
        0.0047619,
        0.00398406,
        0.00719424,
        0.013468,
        0.00288184,
        0.00260417,
        0.00220751,
        0.0242826,
        0.132565,
    ],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0108696,
        0.00970874,
        0.0,
        0.0078125,
        0.0,
        0.00632911,
        0.0,
        0.0,
        0.00440529,
        0.0119522,
        0.00754717,
    ],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0171149, 0.825397],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.0,
        0.0141844,
        0.0,
        0.0,
        0.0052356,
        0.0,
        0.0,
        0.00409836,
        0.0077821,
        0.365854,
    ],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [0.00574713, 0.00537634, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.00958467, 0.0609756],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        5.91716e-03,
        0.00000e00,
        4.42478e-03,
        0.00000e00,
        0.00000e00,
        0.00000e00,
        2.73224e-03,
        2.31482e-03,
        0.00000e00,
        3.63636e-03,
        6.23077e00,
    ],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [0.00675676, 0.0, 0.0, 0.0, 0.0, 0.00440529, 0.0, 0.0, 0.0, 0.0140351, 0.172414],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.00990099,
        0.0,
        0.00787402,
        0.00699301,
        0.0,
        0.0,
        0.0051282,
        0.0,
        0.0165289,
        0.25,
    ],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.00507614, 0.0, 0.00377358, 0.0427046, 0.678571],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.0,
        0.0,
        0.0,
        0.00420168,
        0.00763359,
        0.00322581,
        0.002849,
        0.00251256,
        0.00963855,
        0.0251256,
    ],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [0.0, 0.0, 0.0, 0.0, 0.0, 0.010929, 0.0, 0.0, 0.0, 0.0321543, 0.101307],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.0,
        0.0,
        0.0103093,
        0.00909091,
        0.00854701,
        0.0,
        0.0,
        0.0,
        0.00628931,
        0.00581395,
    ],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.0,
        0.00478469,
        0.00881057,
        0.0,
        0.0,
        0.00395257,
        0.0,
        0.00331126,
        0.0357143,
        0.229551,
    ],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0165289,
        0.0149254,
        0.0140845,
        0.0121212,
        0.0,
        0.00440529,
        0.00409836,
        0.0,
        0.00308642,
        0.00571429,
        0.0833333,
    ],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.00813008,
        0.00694444,
        0.00568182,
        0.00456621,
        0.00423729,
        0.00729927,
        0.0161812,
        0.0191257,
        0.118971,
        0.658333,
    ],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0152672,
        0.0129032,
        0.00671141,
        0.0127389,
        0.00537634,
        0.00873362,
        0.00374532,
        0.00662252,
        0.01875,
        0.0512048,
        0.0610687,
    ],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.0,
        0.0215054,
        0.0165289,
        0.0,
        0.0,
        0.0,
        0.00881057,
        0.00362319,
        0.0550847,
        1.82353,
    ],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.0,
        0.0229885,
        0.00917431,
        0.0,
        0.00714286,
        0.0,
        0.0,
        0.00473934,
        0.0191388,
        1.55357,
    ],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0075188,
        0.00704225,
        0.00636943,
        0.0,
        0.0,
        0.00442478,
        0.0,
        0.0,
        0.01875,
        0.0308642,
        0.205882,
    ],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        7.29927e-03,
        0.00000e00,
        2.51572e-02,
        5.88235e-02,
        0.00000e00,
        0.00000e00,
        0.00000e00,
        1.20120e-02,
        0.00000e00,
        4.62963e-03,
        1.26667e01,
    ],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0119048,
        0.0,
        0.00970874,
        0.0,
        0.0,
        0.0,
        0.00581395,
        0.0,
        0.0,
        0.0304348,
        1.55357,
    ],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.0103093,
        0.00909091,
        0.00806452,
        0.020979,
        0.0,
        0.0,
        0.0384615,
        0.0597015,
        0.0209059,
        2.0,
    ],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.0,
        0.0,
        0.0873786,
        0.0,
        0.0,
        0.00649351,
        0.00568182,
        0.00518135,
        0.102703,
        1.20833,
    ],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.00819672,
        0.0,
        0.00724638,
        0.0327869,
        0.00471698,
        0.00843882,
        0.0111111,
        0.00316456,
        0.00289855,
        0.0334347,
        0.101695,
    ],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.0,
        0.0,
        0.00746269,
        0.0,
        0.00564972,
        0.0,
        0.0163934,
        0.0,
        0.156951,
        0.448718,
    ],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.0,
        0.0,
        0.0,
        0.0208333,
        0.00806452,
        0.0,
        0.0432099,
        0.00558659,
        0.00529101,
        0.0967742,
    ],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_33.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_33.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_33.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_33.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_33.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_33.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_33.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_33.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_33.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_33.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_33.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_33.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_33.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_33.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.00184843,
        0.00493421,
        0.0058997,
        0.00137931,
        0.0013947,
        0.0,
        0.0017452,
        0.0,
        0.00141443,
        0.0257235,
        0.144728,
    ],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0165289,
        0.00531915,
        0.00466745,
        0.0,
        0.0,
        0.00085034,
        0.00084746,
        0.00075132,
        0.0,
        0.00346741,
        0.102564,
    ],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.00236407,
        0.00817996,
        0.00540541,
        0.0042796,
        0.0047619,
        0.00997783,
        0.0255885,
        0.00455373,
        0.0016129,
        0.0674567,
        0.396947,
    ],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0144509,
        0.0164384,
        0.00519481,
        0.00707547,
        0.00215517,
        0.00374532,
        0.0015625,
        0.00280112,
        0.0117035,
        0.0412655,
        0.0220674,
    ],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        2.58398e-03,
        6.96056e-03,
        6.31579e-03,
        1.57729e-03,
        0.00000e00,
        0.00000e00,
        9.38967e-04,
        2.47525e-03,
        7.12251e-04,
        2.61866e-02,
        9.33333e-01,
    ],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.00245098,
        0.00647948,
        0.0110701,
        0.00144718,
        0.00129534,
        0.00116414,
        0.00113122,
        0.00390244,
        0.00362976,
        0.028348,
        0.75576,
    ],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        4.88281e-03,
        2.68577e-03,
        1.57978e-03,
        1.34318e-03,
        5.84112e-04,
        5.43774e-04,
        5.20291e-04,
        4.56830e-04,
        4.15800e-04,
        2.41071e-02,
        5.00000e-01,
    ],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        1.04712e-02,
        7.09220e-03,
        2.32068e-02,
        0.00000e00,
        1.47059e-03,
        4.03226e-03,
        1.20919e-02,
        7.16479e-03,
        8.87311e-04,
        7.11111e-03,
        5.82540e00,
    ],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0046225,
        0.00133869,
        0.0172185,
        0.00113507,
        0.0,
        0.00084317,
        0.00087489,
        0.00082169,
        0.0,
        0.00998336,
        0.366812,
    ],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.00000e00,
        1.17647e-02,
        2.04082e-02,
        8.16326e-03,
        1.40351e-02,
        0.00000e00,
        5.81395e-03,
        5.42005e-03,
        2.60417e-03,
        6.26959e-02,
        3.41667e00,
    ],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        2.24719e-03,
        2.04082e-03,
        1.78253e-03,
        2.87356e-03,
        0.00000e00,
        0.00000e00,
        1.66667e-02,
        0.00000e00,
        1.06383e-02,
        5.89431e-02,
        1.83871e00,
    ],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0109375,
        0.00310077,
        0.00548697,
        0.00362757,
        0.00207684,
        0.00659755,
        0.00619469,
        0.0015186,
        0.00212014,
        0.0104895,
        0.0317941,
    ],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.00258398,
        0.00215517,
        0.0231214,
        0.00143472,
        0.0184729,
        0.00116009,
        0.00102459,
        0.0,
        0.00158604,
        0.0799273,
        0.238771,
    ],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.0,
        0.00310559,
        0.00250627,
        0.00451467,
        0.00381679,
        0.0037594,
        0.00343643,
        0.00332226,
        0.0114379,
        0.0131363,
    ],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.00295858,
        0.0078329,
        0.0070922,
        0.0042735,
        0.0,
        0.0,
        0.00466201,
        0.0,
        0.00222222,
        0.0384615,
        0.204735,
    ],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0202899,
        0.0108992,
        0.00738916,
        0.0,
        0.0,
        0.00153846,
        0.00153374,
        0.00136612,
        0.00133156,
        0.00979021,
        0.0989583,
    ],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.00374532,
        0.0123839,
        0.00560224,
        0.00657895,
        0.00529101,
        0.00977199,
        0.0289193,
        0.0057554,
        0.00258732,
        0.0778816,
        0.426799,
    ],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0122449,
        0.018797,
        0.0114068,
        0.00687285,
        0.00296736,
        0.00481928,
        0.00208768,
        0.00396825,
        0.0180361,
        0.0770878,
        0.0340633,
    ],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        3.81679e-03,
        1.39373e-02,
        1.60772e-02,
        5.02513e-03,
        0.00000e00,
        0.00000e00,
        1.56250e-03,
        4.45765e-03,
        1.36612e-03,
        3.88979e-02,
        1.66165e00,
    ],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.003663,
        0.00666667,
        0.0117994,
        0.00468384,
        0.002,
        0.00358423,
        0.00177305,
        0.00500835,
        0.00329489,
        0.0442656,
        0.688889,
    ],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.00829875,
        0.00378788,
        0.00358423,
        0.00148368,
        0.00128535,
        0.0012285,
        0.00120773,
        0.0,
        0.00111732,
        0.0494438,
        0.283951,
    ],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        1.61290e-02,
        7.19424e-03,
        5.46624e-02,
        0.00000e00,
        2.21730e-03,
        5.63910e-03,
        3.17195e-02,
        1.05263e-02,
        1.30719e-03,
        9.18635e-03,
        6.81250e00,
    ],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.00308642,
        0.00539084,
        0.0178117,
        0.00212766,
        0.0,
        0.0015015,
        0.00150376,
        0.00146843,
        0.0,
        0.0270728,
        0.631944,
    ],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.00900901,
        0.00793651,
        0.00588235,
        0.0148515,
        0.0,
        0.0037594,
        0.00816326,
        0.0204082,
        0.0594059,
        3.0,
    ],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.00396825,
        0.0,
        0.066474,
        0.0,
        0.0,
        0.0413625,
        0.0,
        0.0105708,
        0.087156,
        2.53846,
    ],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0114679,
        0.00421941,
        0.0151803,
        0.00624025,
        0.002574,
        0.0127758,
        0.0121145,
        0.00403226,
        0.00772201,
        0.0190074,
        0.0572738,
    ],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.00380228,
        0.003125,
        0.01983,
        0.00219298,
        0.0165138,
        0.0034965,
        0.00164474,
        0.0,
        0.00144092,
        0.105634,
        0.236111,
    ],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_33.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.0,
        0.0,
        0.00490196,
        0.00393701,
        0.00684932,
        0.00560224,
        0.00746269,
        0.00765306,
        0.00534759,
        0.0235294,
        0.0501475,
    ],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)


@component.add(
    name="Бэлчээрийн малын нядалгааны хувь",
    subscripts=["Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"],
    comp_type="Lookup",
    comp_subtype="Normal",
    depends_on={"__lookup__": "_hardcodedlookup_nvs_34"},
)
def nvs__34(x, final_subs=None):
    return _hardcodedlookup_nvs_34(x, final_subs)


_hardcodedlookup_nvs_34 = HardcodedLookups(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.05625,
        0.031746,
        0.157895,
        0.311203,
        0.223684,
        0.39834,
        0.264706,
        0.0938967,
        0.237548,
        0.281481,
    ],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Адуу"]},
    "interpolate",
    {
        "Дорнод аймгийн сумууд": _subscript_dict["Дорнод аймгийн сумууд"],
        "Бэлчээрийн малын төрөл": _subscript_dict["Бэлчээрийн малын төрөл"],
    },
    "_hardcodedlookup_nvs_34",
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.0952381,
        0.0744681,
        0.0849057,
        0.0504202,
        0.103704,
        0.166667,
        0.0316456,
        0.0806452,
        0.0666667,
        0.77686,
    ],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.0519481,
        0.0824176,
        0.0428571,
        0.119522,
        0.161871,
        0.0572391,
        0.129683,
        0.09375,
        0.253863,
        0.441501,
    ],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.076087,
        0.0485437,
        0.142857,
        0.140625,
        0.107914,
        0.0189873,
        0.173684,
        0.118812,
        0.140969,
        0.187251,
    ],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.19084,
        0.0895522,
        -0.0774194,
        0.045,
        0.148936,
        0.0380228,
        0.135048,
        0.0795455,
        0.250608,
        1.0978,
    ],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.00917431,
        0.103175,
        0.0212766,
        0.101266,
        0.183333,
        0.26178,
        0.11399,
        0.145455,
        0.233607,
        0.988327,
    ],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.091954,
        0.166667,
        0.20202,
        0.181373,
        0.242009,
        0.261062,
        0.106195,
        0.181818,
        0.195122,
        0.990415,
    ],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.118343,
        0.0529101,
        0.0973451,
        0.135135,
        0.19863,
        0.0958466,
        0.0928962,
        0.0972222,
        0.179283,
        1.22727,
    ],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.0608108,
        0.0,
        0.13587,
        0.0478723,
        0.0926829,
        0.185022,
        0.0692641,
        0.108527,
        0.220641,
        0.898246,
    ],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.11828,
        0.108911,
        0.0442478,
        0.0314961,
        0.125874,
        0.126582,
        0.142045,
        0.0974359,
        0.13964,
        1.20661,
    ],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.10084,
        0.150376,
        0.0763889,
        0.0421687,
        0.263959,
        0.154255,
        0.0507614,
        0.0742358,
        0.2,
        1.04626,
    ],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.0529801,
        0.0722892,
        -0.00520833,
        0.136986,
        0.0966387,
        0.0419847,
        0.0903226,
        0.0626781,
        0.175879,
        0.26506,
    ],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.182609,
        -0.032,
        0.0,
        -0.00653595,
        0.283422,
        0.114754,
        -0.00485437,
        0.0784314,
        0.15625,
        0.215434,
    ],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.0,
        0.0,
        0.150538,
        0.0824742,
        0.118182,
        0.0940171,
        0.107692,
        0.171233,
        0.246753,
        0.157233,
    ],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.128205,
        0.188172,
        0.205742,
        0.237885,
        0.195833,
        0.376384,
        0.343874,
        0.181102,
        0.400662,
        -0.0107143,
    ],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.165289,
        0.231343,
        0.176056,
        0.0363636,
        0.140704,
        0.207048,
        0.0737705,
        0.137931,
        0.182099,
        1.0,
    ],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.0510204,
        0.138211,
        0.0833333,
        0.0397727,
        0.205479,
        0.135593,
        0.149635,
        0.100324,
        0.434426,
        0.790997,
    ],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.10687,
        0.309677,
        0.248322,
        0.0955414,
        0.0698925,
        0.122271,
        0.172285,
        0.221854,
        0.253125,
        0.86747,
    ],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.15,
        0.288889,
        -0.0322581,
        0.0165289,
        0.0993377,
        0.265957,
        0.218274,
        0.0748899,
        0.460145,
        1.15254,
    ],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.0714286,
        0.222222,
        -0.045977,
        0.137615,
        0.152,
        0.25,
        0.0794702,
        0.178378,
        0.331754,
        1.311,
    ],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.18797,
        0.211268,
        0.133758,
        0.153846,
        0.21256,
        0.234513,
        0.107438,
        0.208904,
        0.284375,
        1.05864,
    ],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.211679,
        0.241611,
        0.119497,
        0.0802139,
        0.18552,
        0.152,
        0.167808,
        0.114114,
        0.248756,
        1.28241,
    ],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        -0.0952381,
        0.262136,
        0.0194175,
        0.032,
        0.109589,
        0.25,
        0.0290698,
        0.110048,
        0.322176,
        1.01304,
    ],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.119048,
        0.206186,
        0.136364,
        0.104839,
        0.13986,
        0.0864198,
        0.103093,
        0.115385,
        0.16791,
        1.22997,
    ],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.263889,
        0.223684,
        0.129412,
        -0.00970874,
        0.212598,
        0.201439,
        0.149351,
        0.193182,
        0.352332,
        1.04865,
    ],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.114754,
        0.276119,
        -0.0507246,
        0.0382514,
        0.113208,
        0.151899,
        0.103704,
        0.123418,
        0.301449,
        0.364742,
    ],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.0246914,
        0.128713,
        -0.0818182,
        0.0746269,
        0.1875,
        0.169492,
        0.0841584,
        0.143443,
        0.503623,
        0.457399,
    ],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.0357143,
        0.153846,
        0.0277778,
        0.149425,
        -0.0729167,
        0.112903,
        0.108696,
        0.135802,
        0.24581,
        0.259259,
    ],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
    ],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [0.0, 0.0, 0.0, 0.0, -0.5, 0.0, 0.0, 0.333333, 0.0, 0.333333],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        2.85714e-01,
        1.66667e-01,
        0.00000e00,
        -1.58603e-16,
        2.50000e-01,
        2.50000e-01,
        1.25000e-01,
        2.22222e-01,
        2.22222e-01,
        8.88889e-01,
    ],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [-1.0, 0.0, 0.0, -0.5, 0.666667, -0.5, 0.333333, 0.333333, 0.333333, 0.0],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [0.333333, 0.0, 0.25, 0.25, 0.25, 0.25, 0.0, 0.2, 0.4, 1.0],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [-1.0, 0.25, 0.0, 0.6, 0.333333, 0.25, 0.25, 0.25, 0.5, 0.75],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.166667,
        0.166667,
        0.166667,
        0.166667,
        0.0,
        0.285714,
        0.333333,
        0.166667,
        0.166667,
        1.0,
    ],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.0,
        0.2,
        0.0,
        0.166667,
        0.166667,
        0.166667,
        0.166667,
        0.166667,
        0.166667,
        1.16667,
    ],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.00000e00,
        1.66667e-01,
        0.00000e00,
        -1.58603e-16,
        1.25000e-01,
        2.22222e-01,
        2.50000e-01,
        2.50000e-01,
        2.50000e-01,
        1.00000e00,
    ],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.333333,
        0.0,
        0.5,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        1.33333,
    ],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.5, 1.33333],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [0.333333, 0.0, 0.25, -0.25, 0.0, 0.142857, 0.142857, 0.142857, 0.142857, 0.285714],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [0.333333, 0.333333, 0.333333, 0.0, 0.5, 0.333333, 0.333333, 0.333333, 0.0, 0.25],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_34.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.219963,
        0.231908,
        0.271386,
        0.364138,
        0.361227,
        0.578947,
        0.4363,
        0.279339,
        0.523338,
        -0.850482,
    ],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.362259,
        0.268617,
        0.235706,
        0.238911,
        0.318266,
        0.37585,
        0.29322,
        0.308039,
        0.379958,
        1.12691,
    ],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.338061,
        0.263804,
        0.142342,
        0.164051,
        0.305952,
        0.301552,
        0.237462,
        0.23133,
        0.555645,
        0.827712,
    ],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.283237,
        0.328767,
        0.301299,
        0.283019,
        0.221983,
        0.123596,
        0.25,
        0.372549,
        0.40052,
        0.210454,
    ],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.273902,
        0.315545,
        0.0252632,
        0.0473186,
        0.186522,
        0.289421,
        0.277934,
        0.212046,
        0.530627,
        1.08183,
    ],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.205882,
        0.198704,
        0.0645756,
        0.218524,
        0.283679,
        0.391153,
        0.262443,
        0.330732,
        0.508167,
        1.22776,
    ],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.234375,
        0.244405,
        0.177725,
        0.197448,
        0.326519,
        0.309407,
        0.305411,
        0.258109,
        0.442827,
        1.32902,
    ],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.222513,
        0.234043,
        0.035865,
        0.246753,
        0.266176,
        0.255376,
        0.181378,
        0.19652,
        0.39929,
        1.33333,
    ],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.197226,
        0.352075,
        0.181457,
        0.0805902,
        0.275093,
        0.373524,
        0.336833,
        0.290058,
        0.396212,
        1.12729,
    ],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.156716,
        0.205882,
        0.163265,
        0.179592,
        0.108772,
        0.32659,
        0.299419,
        0.287263,
        0.515625,
        1.33856,
    ],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.258427,
        0.226531,
        0.139037,
        0.202586,
        0.31164,
        0.388693,
        0.185714,
        0.301751,
        0.445841,
        1.26321,
    ],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.3125,
        0.311628,
        0.207133,
        0.198307,
        0.266874,
        0.301602,
        0.232743,
        0.283219,
        0.361837,
        0.43986,
    ],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.211886,
        0.252155,
        0.00192678,
        0.167862,
        0.334975,
        0.25522,
        0.258197,
        0.206204,
        0.49088,
        0.588556,
    ],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.17284,
        0.250859,
        0.121118,
        0.203008,
        0.126411,
        0.314885,
        0.293233,
        0.352234,
        0.425249,
        0.408497,
    ],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.221893,
        0.221932,
        0.22695,
        0.32265,
        0.301887,
        0.492063,
        0.515152,
        0.321696,
        0.595556,
        -0.513736,
    ],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.310145,
        0.256131,
        0.221675,
        0.0914761,
        0.265651,
        0.367692,
        0.294479,
        0.330601,
        0.435419,
        1.08951,
    ],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.23221,
        0.256966,
        0.114846,
        0.10307,
        0.257496,
        0.302932,
        0.287671,
        0.263309,
        0.548512,
        0.800623,
    ],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.232653,
        0.368421,
        0.288973,
        0.223368,
        0.11276,
        0.13494,
        0.308977,
        0.456349,
        0.406814,
        0.464668,
    ],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.248092,
        0.292683,
        0.0675241,
        0.0251256,
        0.137931,
        0.295886,
        0.345313,
        0.257058,
        0.512295,
        1.14911,
    ],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.216117,
        0.216667,
        0.123894,
        0.154567,
        0.262,
        0.394265,
        0.351064,
        0.409015,
        0.627677,
        1.11066,
    ],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.257261,
        0.299242,
        0.12724,
        0.169139,
        0.329049,
        0.325553,
        0.414251,
        0.304348,
        0.47486,
        1.18789,
    ],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.185484,
        0.230216,
        0.0257235,
        0.184143,
        0.152993,
        0.204887,
        0.202003,
        0.196992,
        0.36732,
        1.31759,
    ],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.132716,
        0.266846,
        0.0890585,
        0.0489362,
        0.204778,
        0.295796,
        0.341353,
        0.35536,
        0.476812,
        1.00508,
    ],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.244444,
        0.207207,
        0.00793651,
        0.123529,
        0.0643564,
        0.266932,
        0.424812,
        0.334694,
        0.514286,
        1.31683,
    ],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.207965,
        0.18254,
        0.114583,
        0.132948,
        0.223618,
        0.383908,
        0.148418,
        0.296053,
        0.420719,
        1.15596,
    ],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.211009,
        0.229958,
        0.113852,
        0.109204,
        0.220077,
        0.278746,
        0.263216,
        0.315524,
        0.430502,
        0.395987,
    ],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.18251,
        0.271875,
        0.0368272,
        0.114035,
        0.311927,
        0.248252,
        0.274671,
        0.277259,
        0.533141,
        0.487676,
    ],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_34.add(
    [2014.0, 2015.0, 2016.0, 2017.0, 2018.0, 2019.0, 2020.0, 2021.0, 2022.0, 2023.0],
    [
        0.173653,
        0.256545,
        0.0490196,
        0.145669,
        0.0753425,
        0.193277,
        0.360697,
        0.44898,
        0.553476,
        0.441176,
    ],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)


@component.add(
    name="Бэлчээрийн малын түүхэн нөхөн үржих хувь хэмжээ",
    subscripts=["Дорнод аймгийн сумууд", "Бэлчээрийн малын төрөл"],
    comp_type="Lookup",
    comp_subtype="Normal",
    depends_on={"__lookup__": "_hardcodedlookup_nvs_35"},
)
def nvs__35(x, final_subs=None):
    return _hardcodedlookup_nvs_35(x, final_subs)


_hardcodedlookup_nvs_35 = HardcodedLookups(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.2375,
        0.243386,
        0.214912,
        0.257261,
        0.280702,
        0.248963,
        0.308824,
        0.319249,
        0.272031,
        0.303704,
        0.240876,
    ],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Адуу"]},
    "interpolate",
    {
        "Дорнод аймгийн сумууд": _subscript_dict["Дорнод аймгийн сумууд"],
        "Бэлчээрийн малын төрөл": _subscript_dict["Бэлчээрийн малын төрөл"],
    },
    "_hardcodedlookup_nvs_35",
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.22619,
        0.212766,
        0.216981,
        0.184874,
        0.214815,
        0.22,
        0.21519,
        0.209677,
        0.219048,
        0.202479,
        0.529412,
    ],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.233766,
        0.241758,
        0.242857,
        0.231076,
        0.23741,
        0.239057,
        0.239193,
        0.276042,
        0.256071,
        0.231788,
        0.279539,
    ],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.206522,
        0.213592,
        0.218487,
        0.234375,
        0.244604,
        0.227848,
        0.236842,
        0.242574,
        0.251101,
        0.25498,
        0.241509,
    ],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.21374,
        0.246269,
        0.212903,
        0.22,
        0.268085,
        0.220532,
        0.266881,
        0.247159,
        0.245742,
        0.268949,
        1.2381,
    ],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.165138,
        0.222222,
        0.156028,
        0.240506,
        0.244444,
        0.277487,
        0.253886,
        0.254545,
        0.290984,
        0.315175,
        0.951219,
    ],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.166667,
        0.236559,
        0.232323,
        0.254902,
        0.273973,
        0.261062,
        0.274336,
        0.268939,
        0.285714,
        0.261981,
        1.23171,
    ],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.242604,
        0.248677,
        0.247788,
        0.262548,
        0.270548,
        0.265176,
        0.275956,
        0.261574,
        0.2749,
        0.254545,
        8.15385,
    ],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.141892,
        0.157233,
        0.157609,
        0.138298,
        0.2,
        0.207048,
        0.186147,
        0.197674,
        0.234875,
        0.217544,
        0.678161,
    ],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.204301,
        0.237624,
        0.168142,
        0.165354,
        0.237762,
        0.240506,
        0.25,
        0.241026,
        0.22973,
        0.256198,
        7.25,
    ],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.218487,
        0.233083,
        0.229167,
        0.228916,
        0.218274,
        0.202128,
        0.218274,
        0.231441,
        0.264151,
        0.188612,
        1.82143,
    ],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.152318,
        0.228916,
        0.135417,
        0.223744,
        0.201681,
        0.232824,
        0.225806,
        0.19943,
        0.221106,
        0.233735,
        0.19598,
    ],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.269565,
        0.104,
        0.0774648,
        0.215686,
        0.262032,
        0.251366,
        0.23301,
        0.207843,
        0.236111,
        0.231511,
        0.189542,
    ],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.161765,
        0.177215,
        0.193548,
        0.226804,
        0.190909,
        0.213675,
        0.230769,
        0.226027,
        0.279221,
        0.245283,
        0.267442,
    ],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Адуу"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.320513,
        0.311828,
        0.296651,
        0.303965,
        0.325,
        0.309963,
        0.351779,
        0.370079,
        0.331126,
        0.378571,
        0.182058,
    ],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.289256,
        0.30597,
        0.352113,
        0.254545,
        0.281407,
        0.286344,
        0.266393,
        0.255172,
        0.265432,
        0.245714,
        1.17857,
    ],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.306122,
        0.317073,
        0.3125,
        0.289773,
        0.287671,
        0.300847,
        0.284672,
        0.300971,
        0.303279,
        0.29582,
        0.591667,
    ],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.305344,
        0.283871,
        0.308725,
        0.292994,
        0.306452,
        0.296943,
        0.307116,
        0.288079,
        0.309375,
        0.313253,
        0.80916,
    ],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.275,
        0.322222,
        0.290323,
        0.280992,
        0.344371,
        0.31383,
        0.370558,
        0.299559,
        0.318841,
        0.423729,
        0.901961,
    ],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.228571,
        0.296296,
        0.229885,
        0.293578,
        0.272,
        0.335714,
        0.304636,
        0.318919,
        0.327014,
        0.598086,
        1.14286,
    ],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.263158,
        0.323944,
        0.299363,
        0.291209,
        0.304348,
        0.309735,
        0.31405,
        0.304795,
        0.315625,
        0.299383,
        1.82353,
    ],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.306569,
        0.308725,
        0.320755,
        0.320856,
        0.316742,
        0.32,
        0.308219,
        0.333333,
        0.323383,
        0.314815,
        7.75,
    ],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.142857,
        0.262136,
        0.242718,
        0.2,
        0.260274,
        0.27381,
        0.25,
        0.253589,
        0.284519,
        0.286957,
        0.642857,
    ],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.27381,
        0.350515,
        0.272727,
        0.266129,
        0.293706,
        0.283951,
        0.309278,
        0.299145,
        0.298507,
        0.299652,
        5.07143,
    ],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.319444,
        0.342105,
        0.341176,
        0.31068,
        0.307087,
        0.309353,
        0.298701,
        0.295455,
        0.316062,
        0.281081,
        1.625,
    ],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.221311,
        0.30597,
        0.282609,
        0.229508,
        0.235849,
        0.299578,
        0.285185,
        0.218354,
        0.257971,
        0.294833,
        0.233898,
    ],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.271605,
        0.217822,
        0.136364,
        0.276119,
        0.29375,
        0.316384,
        0.292079,
        0.290984,
        0.311594,
        0.313901,
        0.262821,
    ],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.196429,
        0.261538,
        0.236111,
        0.252874,
        0.239583,
        0.233871,
        0.282609,
        0.283951,
        0.307263,
        0.248677,
        0.263441,
    ],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Үхэр"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.0,
    ],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.333333, 0.0, 0.0, 0.0],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.142857,
        0.166667,
        0.166667,
        0.142857,
        0.25,
        0.25,
        0.25,
        0.222222,
        0.222222,
        0.222222,
        0.333333,
    ],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [0.0, 0.0, 0.0, 0.0, 0.333333, 0.0, 0.333333, 0.333333, 0.333333, 0.0, 0.333333],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [0.333333, 0.333333, 0.25, 0.25, 0.25, 0.25, 0.25, 0.2, 0.2, 0.25, 0.0],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [0.0, 0.25, 0.25, 0.2, 0.666667, 0.25, 0.25, 0.25, 0.5, 0.0, 1.0],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.166667,
        0.166667,
        0.166667,
        0.166667,
        0.166667,
        0.142857,
        0.333333,
        0.166667,
        0.166667,
        0.166667,
        1.0,
    ],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.25,
        0.2,
        0.2,
        0.166667,
        0.166667,
        0.166667,
        0.166667,
        0.166667,
        0.166667,
        0.166667,
        0.0,
    ],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [0.2, 0.166667, 0.166667, 0.142857, 0.25, 0.111111, 0.25, 0.25, 0.25, 0.25, 1.0],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.333333,
        0.333333,
        0.25,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.0,
    ],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.333333, 0.0],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.333333,
        0.333333,
        0.25,
        0.25,
        0.166667,
        0.142857,
        0.142857,
        0.142857,
        0.142857,
        0.142857,
        0.166667,
    ],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.25,
        0.333333,
        0.333333,
        0.333333,
        0.333333,
        0.25,
        0.25,
    ],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_35.add(
    [2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Тэмээ"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.345656,
        0.351974,
        0.346608,
        0.354483,
        0.396095,
        0.352227,
        0.493892,
        0.447934,
        0.404526,
        0.508039,
        0.130255,
    ],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.414601,
        0.413564,
        0.3979,
        0.331653,
        0.403137,
        0.380102,
        0.422034,
        0.38843,
        0.383438,
        0.373786,
        1.5698,
    ],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.496454,
        0.406953,
        0.410811,
        0.366619,
        0.384524,
        0.394679,
        0.386899,
        0.365209,
        0.441935,
        0.492252,
        0.377099,
    ],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.352601,
        0.4,
        0.407792,
        0.384434,
        0.375,
        0.325843,
        0.367188,
        0.452381,
        0.357607,
        0.436039,
        0.346109,
    ],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.390181,
        0.424594,
        0.366316,
        0.359621,
        0.392298,
        0.352295,
        0.416901,
        0.372937,
        0.401709,
        0.451718,
        0.721429,
    ],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.343137,
        0.37581,
        0.350554,
        0.337192,
        0.397668,
        0.42142,
        0.423077,
        0.409756,
        0.440109,
        0.468231,
        2.18433,
    ],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.330078,
        0.380483,
        0.35545,
        0.348556,
        0.401285,
        0.355084,
        0.444849,
        0.357241,
        0.374636,
        0.400446,
        10.7642,
    ],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.352851,
        0.364123,
        0.365563,
        0.303065,
        0.377323,
        0.338111,
        0.40245,
        0.331964,
        0.344909,
        0.327787,
        1.51965,
    ],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.425373,
        0.370588,
        0.433673,
        0.35102,
        0.336842,
        0.320809,
        0.377907,
        0.333333,
        0.348958,
        0.438871,
        6.08333,
    ],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.361798,
        0.373469,
        0.381462,
        0.353448,
        0.374218,
        0.378092,
        0.358333,
        0.366632,
        0.408124,
        0.353659,
        10.4516,
    ],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.33125,
        0.444961,
        0.347051,
        0.366385,
        0.370717,
        0.373233,
        0.404425,
        0.35915,
        0.374558,
        0.374126,
        0.39894,
    ],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.413437,
        0.372845,
        0.368015,
        0.33429,
        0.415025,
        0.388631,
        0.382172,
        0.356752,
        0.365583,
        0.436876,
        0.368794,
    ],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.37037,
        0.357388,
        0.363354,
        0.315789,
        0.31377,
        0.333969,
        0.390977,
        0.390034,
        0.445183,
        0.415033,
        0.339901,
    ],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.357988,
        0.334204,
        0.340426,
        0.346154,
        0.358491,
        0.343254,
        0.454545,
        0.44389,
        0.406667,
        0.497253,
        0.139276,
    ],
    {"Дорнод аймгийн сумууд": ["Хэрлэн"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.394203,
        0.373297,
        0.413793,
        0.320166,
        0.365482,
        0.372308,
        0.418712,
        0.357924,
        0.388815,
        0.367832,
        1.42708,
    ],
    {"Дорнод аймгийн сумууд": ["Баяндун"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.445693,
        0.374613,
        0.397759,
        0.35307,
        0.345679,
        0.382736,
        0.374429,
        0.381295,
        0.38163,
        0.506231,
        0.389578,
    ],
    {"Дорнод аймгийн сумууд": ["Баянтүмэн"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.330612,
        0.37594,
        0.406844,
        0.388316,
        0.347181,
        0.293976,
        0.363257,
        0.450397,
        0.360721,
        0.421842,
        0.425791,
    ],
    {"Дорнод аймгийн сумууд": ["Баян Уул"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.347328,
        0.390244,
        0.363344,
        0.341709,
        0.348659,
        0.308544,
        0.398438,
        0.349183,
        0.356557,
        0.403566,
        0.977444,
    ],
    {"Дорнод аймгийн сумууд": ["Булган"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.318681,
        0.353333,
        0.39528,
        0.330211,
        0.38,
        0.408602,
        0.414894,
        0.427379,
        0.449753,
        0.517103,
        1.15556,
    ],
    {"Дорнод аймгийн сумууд": ["Гурванзагал"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.360996,
        0.359848,
        0.33871,
        0.324926,
        0.376607,
        0.34398,
        0.443237,
        0.356052,
        0.379888,
        0.337454,
        4.81482,
    ],
    {"Дорнод аймгийн сумууд": ["Дашбалбар"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.322581,
        0.356115,
        0.337621,
        0.337596,
        0.334812,
        0.336466,
        0.343907,
        0.357895,
        0.364706,
        0.368766,
        4.6875,
    ],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.280864,
        0.331536,
        0.302799,
        0.297872,
        0.341297,
        0.295796,
        0.366917,
        0.370044,
        0.333333,
        0.275804,
        1.0,
    ],
    {"Дорнод аймгийн сумууд": ["Сэргэлэн"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.477778,
        0.351351,
        0.365079,
        0.317647,
        0.321782,
        0.326693,
        0.349624,
        0.342857,
        0.359184,
        0.420792,
        6.33333,
    ],
    {"Дорнод аймгийн сумууд": ["Халхгол"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.323009,
        0.329365,
        0.315972,
        0.349711,
        0.316583,
        0.328736,
        0.29927,
        0.333333,
        0.353066,
        0.272936,
        9.0,
    ],
    {"Дорнод аймгийн сумууд": ["Хөлөнбуйр"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.309633,
        0.345992,
        0.345351,
        0.327613,
        0.330759,
        0.346109,
        0.367841,
        0.363911,
        0.352317,
        0.336853,
        0.320733,
    ],
    {"Дорнод аймгийн сумууд": ["Цагаан Овоо"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.403042,
        0.378125,
        0.348442,
        0.311404,
        0.377982,
        0.314685,
        0.332237,
        0.358255,
        0.353026,
        0.353873,
        0.261574,
    ],
    {"Дорнод аймгийн сумууд": ["Чойбалсан"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.317365,
        0.324607,
        0.29902,
        0.299213,
        0.304795,
        0.32493,
        0.343284,
        0.410714,
        0.467914,
        0.461765,
        0.374631,
    ],
    {"Дорнод аймгийн сумууд": ["Чулуунхороот"], "Бэлчээрийн малын төрөл": ["Ямаа"]},
)

_hardcodedlookup_nvs_35.add(
    [
        2014.0,
        2015.0,
        2016.0,
        2017.0,
        2018.0,
        2019.0,
        2020.0,
        2021.0,
        2022.0,
        2023.0,
        2024.0,
    ],
    [
        0.340314,
        0.361702,
        0.35865,
        0.350649,
        0.361765,
        0.370968,
        0.374849,
        0.357216,
        0.398403,
        0.396444,
        3.8254,
    ],
    {"Дорнод аймгийн сумууд": ["Матад"], "Бэлчээрийн малын төрөл": ["Хонь"]},
)
